pipeFlowReg/case3_transient_rad/constant/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    //location    "constant"
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation       on;

radiationModel  fvDOM;

fvDOMCoeffs
{
    nPhi        16;
    nTheta      8;
    maxIter     3;
    tolerance   1e-5;
    nWeights	 1; 
}

// Number of flow iterations per radiation iteration
solverFreq 1;

//absorptionEmissionModel none;

absorptionEmissionModel constantAbsorptionEmission;

constantAbsorptionEmissionCoeffs
{
   absorptivity    absorptivity    [ m^-1 ]         0.0;
   emissivity      emissivity      [ m^-1 ]         0.0;
   E               E               [ kg m^-1 s^-3 ] 0;
   weight  (1);
}

weight  (1);

scatterModel    constantScatter;

constantScatterCoeffs
{
    sigma           sigma          [m^-1]            1.0;
    C               C              [    ]            1.0;
}

sootModel       none;

transmissivityModel none;


// ************************************************************************* //
