pipeFlowReg/case3_transient_rad/constant/zoneone/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    // location    "constant/zoneone"
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation       on;

radiationModel  fvDOM;

fvDOMCoeffs
{
    nPhi        4;          // azimuthal angles in PI/2 on X-Y.(from Y to X)
    nTheta      2;          // polar angles in PI (from Z to X-Y plane)
    convergence 1e-6;   // convergence criteria for radiation iteration
    maxIter     3;         // maximum number of iterations
    nWeights    1;
    weight  (1);
}

// Number of flow iterations per radiation iteration
solverFreq 1;

absorptionEmissionModel constantAbsorptionEmission;

constantAbsorptionEmissionCoeffs
{
   absorptivity    absorptivity    [ m^-1 ]         0;
   emissivity      emissivity      [ m^-1 ]         0;
   E               E               [ kg m^-1 s^-3 ] 0;
}
weight  (1);
scatterModel    none;

sootModel       none;

transmissivityModel none;


// ************************************************************************* //
